#!/usr/bin/bash
#字体优先顺位

echo "================================================================================"
echo "衬线字体(Serif)优先顺位："
echo ""
fc-match -s serif | head -n 5
echo "--------------------------------------------------------------------------------"
echo "非衬线字体(Sans-Serif)优先顺位："
echo ""
fc-match -s sans-serif | head -n 5
echo "--------------------------------------------------------------------------------"
echo "等宽字体(Monospace)优先顺位："
echo ""
fc-match -s monospace | head -n 5
echo "================================================================================"

